docs mostly
